In [18]:
import pandas as pd

def createBonusColumn(employees: pd.DataFrame) -> pd.DataFrame:
  #return employees.assign(bonus=2 * employees['salary'])
  employees['bonus'] = employees['salary']*2
  return employees

In [19]:
createBonusColumn(df)

      name  salary   bonus
0    Piper    4548    9096
1    Grace   28150   56300
2  Georgia    1103    2206
3   Willow    6593   13186
4     Finn   74576  149152
5   Thomas   24433   48866

In [10]:
filename = 'employees.csv'
df = pd.read_csv(filename)
df.head()

      name  salary
0    Piper    4548
1    Grace   28150
2  Georgia    1103
3   Willow    6593
4     Finn   74576

In [11]:
df['bonus'] = df['salary']*2

In [12]:
df

      name  salary   bonus
0    Piper    4548    9096
1    Grace   28150   56300
2  Georgia    1103    2206
3   Willow    6593   13186
4     Finn   74576  149152
5   Thomas   24433   48866